In [13]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [14]:
a=pd.Series([1,2,3])
a

0    1
1    2
2    3
dtype: int64

## Q2: Change indexes to 11, 12, 13.

In [32]:
a.index=[11,12,13]
a

11    1
12    2
13    3
dtype: int64

## Q3: Retrieve First and second elements.

In [35]:
a[0:2]

11    1
12    2
dtype: int64

## Q4: Add duplicate elements, then remove the duplication.

In [58]:
s=a.append(a,ignore_index=True)
s[6]=2
print("with duplicates:\n")
print(s)
s=s.drop_duplicates()
print("removed duplicates:\n")
print(s)

with duplicates:

0    1
1    2
2    3
3    1
4    2
5    3
6    2
dtype: int64
removed duplicates:

0    1
1    2
2    3
dtype: int64

/var/folders/x5/v3tlskg15f9f7p67b1f0xrmc0000gn/T/ipykernel_18327/4121521165.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s=a.append(a,ignore_index=True)

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [61]:
a=pd.DataFrame(columns=['ID', 'Name', 'GPA'])
a

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [63]:
b=pd.read_csv('educ_figdp_1_Data.csv')

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [81]:
print(b[2:5])#to select indexs
print(b.loc[2:5,'GEO'])#to select indexs and coulmns

   TIME                            GEO  \
2  2002  European Union (28 countries)
3  2003  European Union (28 countries)
4  2004  European Union (28 countries)

                                            INDIC_ED Value Flag and Footnotes
2  Total public expenditure on education as % of ...  5.00                  e
3  Total public expenditure on education as % of ...  5.03                  e
4  Total public expenditure on education as % of ...  4.95                  e
2    European Union (28 countries)
3    European Union (28 countries)
4    European Union (28 countries)
5    European Union (28 countries)
Name: GEO, dtype: object